> ### Is there an existing issue for this?
> 
> - [X] I have searched the existing issues
> 
> ### Community Note
> 
> <!--- Please keep this note for the community --->
> 
> * Please vote on this issue by adding a :thumbsup: [reaction](https://blog.github.com/2016-03-10-add-reactions-to-pull-requests-issues-and-comments/) to the original issue to help the community and maintainers prioritize this request
> * Please do not leave comments along the lines of "+1", "me too" or "any updates", they generate extra noise for issue followers and do not help prioritize the request
> * If you are interested in working on this issue or have submitted a pull request, please leave a comment and review the [contribution guide](https://github.com/hashicorp/terraform-provider-azurerm/blob/main/contributing/README.md) to help.
> 
> <!--- Thank you for keeping this note for the community --->
> 
> 
> ### Terraform Version
> 
> v1.5.7
> 
> ### AzureRM Provider Version
> 
> 3.109
> 
> ### Affected Resource(s)/Data Source(s)
> 
> azuread_group
> 
> ### Terraform Configuration Files
> 
> ```hcl
> data "azuread_group" "sg_XXXX" {
>   display_name     = "SG_XXXX"
>   security_enabled = true
> }
> 
> // Grant XXXX Team access to the storage account in XXX
> resource "azurerm_role_assignment" "az-ad-st-assignment-sg-data" {
>   count               = var.ENV == "XXX" ? 1 : 0
> 
>   scope                = module.storage_account.storage_account_id
>   role_definition_name = "Storage Blob Data Reader"
>   principal_id         = data.azuread_group.sg_data.id
> }
> ```
> 
> 
> ### Debug Output/Panic Output
> 
> ```shell
> azurerm_role_assignment.az-ad-st-assignment-sg-xxx[0] must be replaced
> -/+ resource "azurerm_role_assignment" "az-ad-st-assignment-sg-lclf" {
>       ~ id                               = "/subscriptions/SUBSCRIPTION_ID/resourceGroups/ENV-dataprotection-rg/providers/Microsoft.Storage/storageAccounts/ENVXXdpst/providers/Microsoft.Authorization/roleAssignments/43ca987d-XXXX-4b04-XXXX-b4188401a3fc" -> (known after apply)
>       ~ name                             = "43ca987d-XXXX-4b04-XXXX-b4188401a3fc" -> (known after apply)
>       ~ principal_id                     = "78f2bfaa-XXXX-413e-XXXX-0e461bf43a40" -> "/groups/78f2bfaa-XXXX-413e-XXXX-0e461bf43a40" # forces replacement
>       ~ principal_type                   = "Group" -> (known after apply)
>       ~ role_definition_id               = "/subscriptions/SUBSCRIPTION_ID/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1" -> (known after apply)
>       + skip_service_principal_aad_check = (known after apply)
>         # (2 unchanged attributes hidden)
>     }
> 
> 
>  Error: authorization.RoleAssignmentsClient#Create: Failure responding to request: StatusCode=400 -- Original Error: autorest/azure: Service returned an error. Status=400 Code="InvalidPrincipalId" Message="The Principal ID '/groups/78f2bfaa-XXX-XXX-XXX-0e461bf4XXXX' is not valid. Principal ID must be a GUID."
> │ 
> │   with azurerm_role_assignment.az-ad-st-assignment-sg-lclf[0],
> │   on main.tf line 99, in resource "azurerm_role_assignment" "az-ad-st-assignment-sg-XXXX":
> │   99: resource "azurerm_role_assignment" "az-ad-st-assignment-sg-XXXX" {
> │ 
> ╵
> 
> ```
> 
> 
> ### Expected Behaviour
> 
> No change should have been detected.
> 
> ### Actual Behaviour
> 
> The value of the ID field from azuread_group has changed. It now has the /groups/ value in it.
> We know this value is not in the doc since v1 of azuread but we did not get the depreciation message.
> Also we only use the azurerm provider and not the azuread provider.
> 
> ### Steps to Reproduce
> 
> - get the entra group id of a group
> - use this value in principal_id field in azurerm_role_assignment command
> 
> ### Important Factoids
> 
> N/A
> 
> ### References
> 
> _No response_

Should I replace the principal id with an object_Id?